In [24]:
import pandas as pd
df = pd.read_excel('survey_edit2.xlsx')
df.head()

  category         title
0      대자연  등산하고 경치 구경하기
1       일상      하루종일 잠자기
2       일상      여자친구 사귀기
3       여행          세계일주
4     자기계발       일본어 배우기

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   category  397 non-null    object
 1   title     397 non-null    object
dtypes: object(2)
memory usage: 6.3+ KB

In [26]:
df.describe()

       category   title
count       397     397
unique        9     384
top          여행  스카이다이빙
freq         95       4

In [27]:
df.drop_duplicates()

    category               title
0        대자연        등산하고 경치 구경하기
1         일상            하루종일 잠자기
2         일상            여자친구 사귀기
3         여행                세계일주
4       자기계발             일본어 배우기
..       ...                 ...
392       일상             운전면허 따기
393       일상        나의 강아지와 산책가기
394       여행     퍼스트 클래스 라면 먹어보기
395       일상              집문서 소유
396       여행  제주도 한바퀴 돌면서 서핑여행하기

[384 rows x 2 columns]

In [28]:
df['category'].drop_duplicates()

0       대자연
1        일상
3        여행
4      자기계발
7       스포츠
10     문화예술
22       푸드
23     아웃도어
118      쇼핑
Name: category, dtype: object

In [30]:
df.to_csv('survey_final.csv', encoding='cp949', index=False)